Revit 2027 API
CircuitNaming Enumeration
 An enumerated type listing all the circuit naming options.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum CircuitNaming
Public Enumeration CircuitNaming
public enum class CircuitNaming
type CircuitNaming
Members
Member name | Value | Description
Customized | 5 |  Circuit naming is user defined.
PanelName | 2 |  Circuit naming is Panel Name.
Phase | 3 |  Circuit naming is By Phase.
Prefixed | 0 |  Circuit naming is Prefixed.
ProjectSetting | 4 |  Circuit naming is By Project Setting.
Standard | 1 |  Circuit naming is Standard.
Undefined | -1 |  Circuit naming is Undefined.
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace